Este jupyter ha sido tomado del link 

https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html

# 10 Minutes to pandas

This is a short introduction to pandas, geared mainly for new users. You can see more complex recipes in the [Cookbook](http://pandas.pydata.org/pandas-docs/stable/cookbook.html#cookbook)

Customarily, we import as follows:

In [1]:
import pandas as pd
import numpy as np

## Object Creation

See the [Data Structure Intro section](http://pandas.pydata.org/pandas-docs/stable/dsintro.html#dsintro)

Creating a Series by passing a list of values, letting pandas create a default integer index:

In [2]:
s = pd.Series([1,3,5,np.nan,6,8])

In [3]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

Creating a DataFrame by passing a numpy array, with a datetime index and labeled columns:

In [4]:
dates = pd.date_range('20130101', periods=6)

In [5]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [6]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

In [7]:
df

                   A         B         C         D
2013-01-01 -0.163385 -1.227888 -0.492055  0.103336
2013-01-02  1.232676 -0.111203  0.045878 -0.104174
2013-01-03  1.847789 -0.113161  0.439633 -0.338789
2013-01-04  0.225081 -1.405101 -0.632085 -0.130457
2013-01-05 -0.158517  3.230630 -0.105978 -0.792163
2013-01-06 -1.116412 -0.368741 -0.715909  1.041639

Creating a DataFrame by passing a dict of objects that can be converted to series-like.

In [8]:
df2 = pd.DataFrame({'A':1.,
                   'B':pd.Timestamp('20130102'),
                   'C':pd.Series(1,index=list(range(4)),dtype='float32'),
                   'D':np.array([3]*4,dtype='int32'),
                   'E':pd.Categorical(["test","train","test","train"]),
                   'F':'foo'})

In [9]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

Having specific [dtypes](http://pandas.pydata.org/pandas-docs/stable/basics.html#basics-dtypes)

In [10]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

## Viewing Data

See the [Basics section](http://pandas.pydata.org/pandas-docs/stable/basics.html#basics)

See the top & bottom rows of the frame

In [11]:
df.head()

                   A         B         C         D
2013-01-01 -0.163385 -1.227888 -0.492055  0.103336
2013-01-02  1.232676 -0.111203  0.045878 -0.104174
2013-01-03  1.847789 -0.113161  0.439633 -0.338789
2013-01-04  0.225081 -1.405101 -0.632085 -0.130457
2013-01-05 -0.158517  3.230630 -0.105978 -0.792163

In [12]:
df.tail(3)

                   A         B         C         D
2013-01-04  0.225081 -1.405101 -0.632085 -0.130457
2013-01-05 -0.158517  3.230630 -0.105978 -0.792163
2013-01-06 -1.116412 -0.368741 -0.715909  1.041639

Display the index, columns, and the underlying numpy data

In [13]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [14]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [15]:
df.values

array([[-0.1633855 , -1.22788846, -0.49205484,  0.10333564],
       [ 1.23267574, -0.11120256,  0.04587761, -0.10417386],
       [ 1.84778928, -0.11316128,  0.43963302, -0.33878864],
       [ 0.22508103, -1.40510097, -0.63208494, -0.13045666],
       [-0.15851675,  3.23063034, -0.10597847, -0.79216252],
       [-1.11641231, -0.36874068, -0.71590946,  1.04163891]])

Describe shows a quick statistic summary of your data

In [16]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.311205  0.000756 -0.243420 -0.036768
std    1.067856  1.678102  0.448391  0.609549
min   -1.116412 -1.405101 -0.715909 -0.792163
25%   -0.162168 -1.013102 -0.597077 -0.286706
50%    0.033282 -0.240951 -0.299017 -0.117315
75%    0.980777 -0.111692  0.007914  0.051458
max    1.847789  3.230630  0.439633  1.041639

Transposing your data

In [17]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.163385    1.232676    1.847789    0.225081   -0.158517   -1.116412
B   -1.227888   -0.111203   -0.113161   -1.405101    3.230630   -0.368741
C   -0.492055    0.045878    0.439633   -0.632085   -0.105978   -0.715909
D    0.103336   -0.104174   -0.338789   -0.130457   -0.792163    1.041639

Sorting by an axis

In [18]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.103336 -0.492055 -1.227888 -0.163385
2013-01-02 -0.104174  0.045878 -0.111203  1.232676
2013-01-03 -0.338789  0.439633 -0.113161  1.847789
2013-01-04 -0.130457 -0.632085 -1.405101  0.225081
2013-01-05 -0.792163 -0.105978  3.230630 -0.158517
2013-01-06  1.041639 -0.715909 -0.368741 -1.116412

Sorting by value

In [19]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-04  0.225081 -1.405101 -0.632085 -0.130457
2013-01-01 -0.163385 -1.227888 -0.492055  0.103336
2013-01-06 -1.116412 -0.368741 -0.715909  1.041639
2013-01-03  1.847789 -0.113161  0.439633 -0.338789
2013-01-02  1.232676 -0.111203  0.045878 -0.104174
2013-01-05 -0.158517  3.230630 -0.105978 -0.792163

## Selection

**Note:** While standard Python / Numpy expressions for selecting and setting are intuitive and come in handy for interactive work, for production code, we recommend the optimized pandas data access methods, .at, .iat, .loc, .iloc and .ix.

See the indexing documentation [Indexing and Selecting Data](http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing) and [MultiIndex / Advanced Indexing](http://pandas.pydata.org/pandas-docs/stable/advanced.html#advanced)

### Getting

Selecting a single column, which yields a Series, equivalent to df.A

In [20]:
df['A']

2013-01-01   -0.163385
2013-01-02    1.232676
2013-01-03    1.847789
2013-01-04    0.225081
2013-01-05   -0.158517
2013-01-06   -1.116412
Freq: D, Name: A, dtype: float64

Selecting via [], which slices the rows.

In [21]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.163385 -1.227888 -0.492055  0.103336
2013-01-02  1.232676 -0.111203  0.045878 -0.104174
2013-01-03  1.847789 -0.113161  0.439633 -0.338789

In [22]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  1.232676 -0.111203  0.045878 -0.104174
2013-01-03  1.847789 -0.113161  0.439633 -0.338789
2013-01-04  0.225081 -1.405101 -0.632085 -0.130457

### Selection by Label

See more in [Selection by Label](Selection by Label)

For getting a cross section using a label

In [23]:
df.loc[dates[0]]

A   -0.163385
B   -1.227888
C   -0.492055
D    0.103336
Name: 2013-01-01 00:00:00, dtype: float64

Selection by Label

In [24]:
df.loc[:,['A','B']]

                   A         B
2013-01-01 -0.163385 -1.227888
2013-01-02  1.232676 -0.111203
2013-01-03  1.847789 -0.113161
2013-01-04  0.225081 -1.405101
2013-01-05 -0.158517  3.230630
2013-01-06 -1.116412 -0.368741

Showing label slicing, both endpoints are included

In [25]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02  1.232676 -0.111203
2013-01-03  1.847789 -0.113161
2013-01-04  0.225081 -1.405101

Reduction in the dimensions of the returned object

In [26]:
df.loc['20130102',['A','B']]

A    1.232676
B   -0.111203
Name: 2013-01-02 00:00:00, dtype: float64

For getting a scalar value

In [27]:
df.loc[dates[0],'A']

-0.16338549545155512

### Selection by Position

See more in [Selection by Position](http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-integer)

Select via the position of the passed integers

In [28]:
df.iloc[3]

A    0.225081
B   -1.405101
C   -0.632085
D   -0.130457
Name: 2013-01-04 00:00:00, dtype: float64

By integer slices, acting similar to numpy/python

In [29]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04  0.225081 -1.405101
2013-01-05 -0.158517  3.230630

By lists of integer position locations, similar to the numpy/python style

In [30]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  1.232676  0.045878
2013-01-03  1.847789  0.439633
2013-01-05 -0.158517 -0.105978

For slicing rows explicitly

In [31]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02  1.232676 -0.111203  0.045878 -0.104174
2013-01-03  1.847789 -0.113161  0.439633 -0.338789

For slicing columns explicitly

In [32]:
df.iloc[:,1:3]

                   B         C
2013-01-01 -1.227888 -0.492055
2013-01-02 -0.111203  0.045878
2013-01-03 -0.113161  0.439633
2013-01-04 -1.405101 -0.632085
2013-01-05  3.230630 -0.105978
2013-01-06 -0.368741 -0.715909

For getting a value explicitly

In [33]:
df.iloc[1,1]

-0.1112025618817647

For getting fast access to a scalar (equiv to the prior method)

In [34]:
df.iat[1,1]

-0.1112025618817647

## Boolean Indexing

Using a single column’s values to select data.

In [35]:
df[df.A > 0]

                   A         B         C         D
2013-01-02  1.232676 -0.111203  0.045878 -0.104174
2013-01-03  1.847789 -0.113161  0.439633 -0.338789
2013-01-04  0.225081 -1.405101 -0.632085 -0.130457

A where operation for getting.

In [36]:
df[df > 0]

                   A        B         C         D
2013-01-01       NaN      NaN       NaN  0.103336
2013-01-02  1.232676      NaN  0.045878       NaN
2013-01-03  1.847789      NaN  0.439633       NaN
2013-01-04  0.225081      NaN       NaN       NaN
2013-01-05       NaN  3.23063       NaN       NaN
2013-01-06       NaN      NaN       NaN  1.041639

Using the isin() method for filtering:

In [37]:
df2 = df.copy()

In [38]:
df2['E'] = ['one','one', 'two','three','four','three']

In [39]:
df2

                   A         B         C         D      E
2013-01-01 -0.163385 -1.227888 -0.492055  0.103336    one
2013-01-02  1.232676 -0.111203  0.045878 -0.104174    one
2013-01-03  1.847789 -0.113161  0.439633 -0.338789    two
2013-01-04  0.225081 -1.405101 -0.632085 -0.130457  three
2013-01-05 -0.158517  3.230630 -0.105978 -0.792163   four
2013-01-06 -1.116412 -0.368741 -0.715909  1.041639  three

In [40]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03  1.847789 -0.113161  0.439633 -0.338789   two
2013-01-05 -0.158517  3.230630 -0.105978 -0.792163  four

## Setting

Setting a new column automatically aligns the data by the indexes

In [41]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102',periods=6))

In [42]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [43]:
df['F'] = s1

Setting values by label

In [44]:
df.at[dates[0],'A'] = 0

Settomg values by position

In [45]:
df.iat[0,1] = 0

Setting by assigning with a numpy array

In [46]:
df.loc[:,'D'] = np.array([5] * len(df))

The result of the prior setting operations

In [47]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.492055  5  NaN
2013-01-02  1.232676 -0.111203  0.045878  5  1.0
2013-01-03  1.847789 -0.113161  0.439633  5  2.0
2013-01-04  0.225081 -1.405101 -0.632085  5  3.0
2013-01-05 -0.158517  3.230630 -0.105978  5  4.0
2013-01-06 -1.116412 -0.368741 -0.715909  5  5.0

A where operation with setting.

In [48]:
df2 = df.copy()

In [49]:
df2[df2 > 0] = -df2

In [50]:
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.492055 -5  NaN
2013-01-02 -1.232676 -0.111203 -0.045878 -5 -1.0
2013-01-03 -1.847789 -0.113161 -0.439633 -5 -2.0
2013-01-04 -0.225081 -1.405101 -0.632085 -5 -3.0
2013-01-05 -0.158517 -3.230630 -0.105978 -5 -4.0
2013-01-06 -1.116412 -0.368741 -0.715909 -5 -5.0

## Missing Data

pandas primarily uses the value np.nan to represent missing data. It is by default not included in computations. See the Missing Data section

Reindexing allows you to change/add/delete the index on a specified axis. This returns a copy of the data.

In [51]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

In [52]:
df1.loc[dates[0]:dates[1],'E'] = 1

In [53]:
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -0.492055  5  NaN  1.0
2013-01-02  1.232676 -0.111203  0.045878  5  1.0  1.0
2013-01-03  1.847789 -0.113161  0.439633  5  2.0  NaN
2013-01-04  0.225081 -1.405101 -0.632085  5  3.0  NaN

To drop any rows that have missing data.

In [54]:
df1.dropna(how='any')

                   A         B         C  D    F    E
2013-01-02  1.232676 -0.111203  0.045878  5  1.0  1.0

Filling missing data

In [55]:
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -0.492055  5  5.0  1.0
2013-01-02  1.232676 -0.111203  0.045878  5  1.0  1.0
2013-01-03  1.847789 -0.113161  0.439633  5  2.0  5.0
2013-01-04  0.225081 -1.405101 -0.632085  5  3.0  5.0

To get the boolean mask where values are nan

In [56]:
pd.isnull(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

## Operations

See the [Basic section on Binary Ops](http://pandas.pydata.org/pandas-docs/stable/basics.html#basics-binop)

### Stats

Operations in general exclude missing data.

Performing a descriptive statistic

In [57]:
df.mean()

A    0.338436
B    0.205404
C   -0.243420
D    5.000000
F    3.000000
dtype: float64

Same operation on the other axis

In [58]:
df.mean(1)

2013-01-01    1.126986
2013-01-02    1.433470
2013-01-03    1.834852
2013-01-04    1.237579
2013-01-05    2.393227
2013-01-06    1.559788
Freq: D, dtype: float64

Operating with objects that have different dimensionality and need alignment. In addition, pandas automatically broadcasts along the specified dimension.

In [59]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)

In [60]:
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [61]:
df.sub(s, axis='index')

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03  0.847789 -1.113161 -0.560367  4.0  1.0
2013-01-04 -2.774919 -4.405101 -3.632085  2.0  0.0
2013-01-05 -5.158517 -1.769370 -5.105978  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

### Apply

Applying functions to the data

In [62]:
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01  0.000000  0.000000 -0.492055   5   NaN
2013-01-02  1.232676 -0.111203 -0.446177  10   1.0
2013-01-03  3.080465 -0.224364 -0.006544  15   3.0
2013-01-04  3.305546 -1.629465 -0.638629  20   6.0
2013-01-05  3.147029  1.601166 -0.744608  25  10.0
2013-01-06  2.030617  1.232425 -1.460517  30  15.0

In [63]:
df.apply(lambda x: x.max() - x.min())

A    2.964202
B    4.635731
C    1.155542
D    0.000000
F    4.000000
dtype: float64

### Histogramming

See more at [Histogramming and Discretization](http://pandas.pydata.org/pandas-docs/stable/basics.html#basics-discretization)

In [64]:
s = pd.Series(np.random.randint(0, 7, size=10))

In [65]:
s

0    5
1    4
2    5
3    1
4    4
5    0
6    0
7    3
8    6
9    2
dtype: int32

In [66]:
s.value_counts()

5    2
4    2
0    2
6    1
3    1
2    1
1    1
dtype: int64

### String Methods

Series is equipped with a set of string processing methods in the str attribute that make it easy to operate on each element of the array, as in the code snippet below. Note that pattern-matching in str generally uses [regular expressions](https://docs.python.org/2/library/re.html) by default (and in some cases always uses them). See more at [Vectorized String Methods](http://pandas.pydata.org/pandas-docs/stable/text.html#text-string-methods).

In [67]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])
s

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

In [68]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

## Merge

### Concat

pandas provides various facilities for easily combining together Series, DataFrame, and Panel objects with various kinds of set logic for the indexes and relational algebra functionality in the case of join / merge-type operations.

See the [Merging section](http://pandas.pydata.org/pandas-docs/stable/merging.html#merging)

Concatenating pandas objects together with concat():

In [69]:
df = pd.DataFrame(np.random.randn(10, 4))

In [70]:
df

          0         1         2         3
0 -0.660567 -1.243161  0.521860  0.369133
1 -0.379731  1.068958 -0.026352 -0.183493
2  0.729770  1.651942  0.773006 -0.326765
3 -0.369671  1.002491 -0.575372  1.864049
4  0.135538  1.784280 -0.198860 -1.367582
5 -0.421161 -0.177952 -0.613432  0.173406
6  0.210509  0.698254 -1.086802 -0.807458
7 -0.523996 -1.897642 -1.854999  0.594781
8 -1.351561 -0.783089  0.308116  0.956495
9 -0.202651 -0.533270  1.845399  0.306201

In [71]:
# break it into pieces
pieces = [df[:3], df[3:7], df[7:]]
pieces

[          0         1         2         3
 0 -0.660567 -1.243161  0.521860  0.369133
 1 -0.379731  1.068958 -0.026352 -0.183493
 2  0.729770  1.651942  0.773006 -0.326765,
           0         1         2         3
 3 -0.369671  1.002491 -0.575372  1.864049
 4  0.135538  1.784280 -0.198860 -1.367582
 5 -0.421161 -0.177952 -0.613432  0.173406
 6  0.210509  0.698254 -1.086802 -0.807458,
           0         1         2         3
 7 -0.523996 -1.897642 -1.854999  0.594781
 8 -1.351561 -0.783089  0.308116  0.956495
 9 -0.202651 -0.533270  1.845399  0.306201]

In [72]:
pd.concat(pieces)

          0         1         2         3
0 -0.660567 -1.243161  0.521860  0.369133
1 -0.379731  1.068958 -0.026352 -0.183493
2  0.729770  1.651942  0.773006 -0.326765
3 -0.369671  1.002491 -0.575372  1.864049
4  0.135538  1.784280 -0.198860 -1.367582
5 -0.421161 -0.177952 -0.613432  0.173406
6  0.210509  0.698254 -1.086802 -0.807458
7 -0.523996 -1.897642 -1.854999  0.594781
8 -1.351561 -0.783089  0.308116  0.956495
9 -0.202651 -0.533270  1.845399  0.306201

### Join

SQL style merges. See the [Database style joining](http://pandas.pydata.org/pandas-docs/stable/merging.html#merging-join)

In [73]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})

In [74]:
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})

In [75]:
left

   key  lval
0  foo     1
1  foo     2

In [76]:
right

   key  rval
0  foo     4
1  foo     5

In [77]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

### Append

Append rows to a dataframe. See the [Appending](http://pandas.pydata.org/pandas-docs/stable/merging.html#merging-concatenation)

In [78]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A','B','C','D'])

In [79]:
df

          A         B         C         D
0  0.077918 -1.037813 -0.151160  1.142223
1  0.547049  0.175536 -0.264234 -1.161206
2  0.861518  1.381743 -0.539169  0.512507
3  0.607017  2.110795 -0.760922  0.744193
4  0.132276  0.585936  0.550820 -0.330440
5 -1.811073 -0.180441 -1.087978 -0.375040
6  1.145108 -0.166761  0.947728  1.469376
7  1.282929 -0.241534  0.637401  0.169002

In [80]:
s = df.iloc[3]

In [81]:
df.append(s, ignore_index=True)

          A         B         C         D
0  0.077918 -1.037813 -0.151160  1.142223
1  0.547049  0.175536 -0.264234 -1.161206
2  0.861518  1.381743 -0.539169  0.512507
3  0.607017  2.110795 -0.760922  0.744193
4  0.132276  0.585936  0.550820 -0.330440
5 -1.811073 -0.180441 -1.087978 -0.375040
6  1.145108 -0.166761  0.947728  1.469376
7  1.282929 -0.241534  0.637401  0.169002
8  0.607017  2.110795 -0.760922  0.744193

## Grouping

By “group by” we are referring to a process involving one or more of the following steps

* **Splitting** the data into groups based on some criteria
* **Applying** a function to each group independently
* **Combining** the results into a data structure

See the [Grouping section](http://pandas.pydata.org/pandas-docs/stable/groupby.html#groupby)

In [82]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar', 'foo', 'bar', 'foo', 'foo'],
                                    'B' : ['one', 'one', 'two', 'three','two', 'two', 'one', 'three'],
                                    'C' : np.random.randn(8),
                                     'D' : np.random.randn(8)})

In [83]:
df

     A      B         C         D
0  foo    one  0.862492  1.540930
1  bar    one -0.757891 -0.267303
2  foo    two -0.119392  0.140784
3  bar  three -1.243754 -0.960530
4  foo    two -0.042872  0.628467
5  bar    two -0.360440  0.460201
6  foo    one -1.265764  0.305207
7  foo  three -1.347773  0.124335

Grouping and then applying a function sum to the resulting groups.

In [84]:
df.groupby('A').sum()

            C         D
A
bar -2.362085 -0.767632
foo -1.913309  2.739723

In [85]:
df.groupby(['A','B']).sum()

                  C         D
A   B
bar one   -0.757891 -0.267303
    three -1.243754 -0.960530
    two   -0.360440  0.460201
foo one   -0.403272  1.846137
    three -1.347773  0.124335
    two   -0.162264  0.769251

## Reshaping

See the sections on [Hierarchical Indexing](http://pandas.pydata.org/pandas-docs/stable/advanced.html#advanced-hierarchical) and [Reshaping](http://pandas.pydata.org/pandas-docs/stable/reshaping.html#reshaping-stacking).

### Stack

In [86]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'],
                                ['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two']]))

In [87]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])

In [88]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])

In [89]:
df2 = df[:4]

In [90]:
df2

                     A         B
first second
bar   one    -2.314232 -0.333671
      two     0.445477 -0.747104
baz   one     0.768223  0.243651
      two     0.127293 -0.931010

The stack() method “compresses” a level in the DataFrame’s columns.

In [91]:
stacked = df2.stack()

In [92]:
stacked

first  second
bar    one     A   -2.314232
               B   -0.333671
       two     A    0.445477
               B   -0.747104
baz    one     A    0.768223
               B    0.243651
       two     A    0.127293
               B   -0.931010
dtype: float64

With a “stacked” DataFrame or Series (having a MultiIndex as the index), the inverse operation of stack() is unstack(), which by default unstacks the **last level**:

In [93]:
stacked.unstack()

                     A         B
first second
bar   one    -2.314232 -0.333671
      two     0.445477 -0.747104
baz   one     0.768223  0.243651
      two     0.127293 -0.931010

In [94]:
stacked.unstack(1)

second        one       two
first
bar   A -2.314232  0.445477
      B -0.333671 -0.747104
baz   A  0.768223  0.127293
      B  0.243651 -0.931010

In [95]:
stacked.unstack(0)

first          bar       baz
second
one    A -2.314232  0.768223
       B -0.333671  0.243651
two    A  0.445477  0.127293
       B -0.747104 -0.931010

### Pivot Tables

See the section on [Pivot Tables](http://pandas.pydata.org/pandas-docs/stable/reshaping.html#reshaping-pivot).

In [96]:
df = pd.DataFrame({'A' : ['one', 'one', 'two', 'three'] * 3,
                                    'B' : ['A', 'B', 'C'] * 4,
                                    'C' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                                    'D' : np.random.randn(12),
                                    'E' : np.random.randn(12)})

In [97]:
df

        A  B    C         D         E
0     one  A  foo  0.622216  0.199726
1     one  B  foo -0.470566  1.595466
2     two  C  foo -0.388165  1.731308
3   three  A  bar -0.263841  1.013028
4     one  B  bar -0.643286 -1.312281
5     one  C  bar  1.330636  0.439669
6     two  A  foo -0.909838  1.664019
7   three  B  foo  1.130813 -0.038287
8     one  C  foo  0.008961  2.037208
9     one  A  bar  2.300743 -1.083641
10    two  B  bar  0.591726  0.133389
11  three  C  bar  0.436538  0.470798

We can produce pivot tables from this data very easily:

In [98]:
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])

C             bar       foo
A     B
one   A  2.300743  0.622216
      B -0.643286 -0.470566
      C  1.330636  0.008961
three A -0.263841       NaN
      B       NaN  1.130813
      C  0.436538       NaN
two   A       NaN -0.909838
      B  0.591726       NaN
      C       NaN -0.388165

## Time Series

pandas has simple, powerful, and efficient functionality for performing resampling operations during frequency conversion (e.g., converting secondly data into 5-minutely data). This is extremely common in, but not limited to, financial applications. See the [Time Series section](http://pandas.pydata.org/pandas-docs/stable/timeseries.html#timeseries)

In [99]:
rng = pd.date_range('1/1/2012', periods=100, freq='S')

In [100]:
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)

In [101]:
ts.resample('5Min').sum()

2012-01-01    23727
Freq: 5T, dtype: int32

Time zone representation

In [102]:
rng = pd.date_range('3/6/2012 00:00', periods=5, freq='D')

In [103]:
ts = pd.Series(np.random.randn(len(rng)), rng)

In [104]:
ts

2012-03-06   -0.949462
2012-03-07    1.106503
2012-03-08   -0.275504
2012-03-09    1.260619
2012-03-10    1.287915
Freq: D, dtype: float64

In [105]:
ts_utc = ts.tz_localize('UTC')

In [106]:
ts_utc

2012-03-06 00:00:00+00:00   -0.949462
2012-03-07 00:00:00+00:00    1.106503
2012-03-08 00:00:00+00:00   -0.275504
2012-03-09 00:00:00+00:00    1.260619
2012-03-10 00:00:00+00:00    1.287915
Freq: D, dtype: float64


Convert to another time zone

In [107]:
ts_utc.tz_convert('US/Eastern')

2012-03-05 19:00:00-05:00   -0.949462
2012-03-06 19:00:00-05:00    1.106503
2012-03-07 19:00:00-05:00   -0.275504
2012-03-08 19:00:00-05:00    1.260619
2012-03-09 19:00:00-05:00    1.287915
Freq: D, dtype: float64


Converting between time span representations

In [108]:
rng = pd.date_range('1/1/2012', periods=5, freq='M')

In [109]:
ts = pd.Series(np.random.randn(len(rng)), index=rng)

In [110]:
ts

2012-01-31   -2.016634
2012-02-29    0.704884
2012-03-31   -0.097077
2012-04-30    0.890758
2012-05-31    1.816892
Freq: M, dtype: float64

In [111]:
ps = ts.to_period()

In [112]:
ps

2012-01   -2.016634
2012-02    0.704884
2012-03   -0.097077
2012-04    0.890758
2012-05    1.816892
Freq: M, dtype: float64

In [113]:
ps.to_timestamp()

2012-01-01   -2.016634
2012-02-01    0.704884
2012-03-01   -0.097077
2012-04-01    0.890758
2012-05-01    1.816892
Freq: MS, dtype: float64

Converting between period and timestamp enables some convenient arithmetic functions to be used. In the following example, we convert a quarterly frequency with year ending in November to 9am of the end of the month following the quarter end:

In [114]:
prng = pd.period_range('1990Q1', '2000Q4', freq='Q-NOV')

In [115]:
ts = pd.Series(np.random.randn(len(prng)), prng)

In [116]:
ts.index = (prng.asfreq('M', 'e') + 1).asfreq('H', 's') + 9

In [117]:
ts.head()

1990-03-01 09:00   -1.522363
1990-06-01 09:00    0.859458
1990-09-01 09:00   -1.332333
1990-12-01 09:00    0.736906
1991-03-01 09:00   -0.310677
Freq: H, dtype: float64

## Categoricals

Since version 0.15, pandas can include categorical data in a DataFrame. For full docs, see the [categorical introduction](http://pandas.pydata.org/pandas-docs/stable/categorical.html#categorical) and the [API documentation](http://pandas.pydata.org/pandas-docs/stable/api.html#api-categorical).

In [118]:
df = pd.DataFrame({"id":[1,2,3,4,5,6], "raw_grade":['a', 'b', 'b', 'a', 'a', 'e']})

Convert the raw grades to a categorical data type.

In [119]:
df["grade"] = df["raw_grade"].astype("category")

In [120]:
df["grade"]

0    a
1    b
2    b
3    a
4    a
5    e
Name: grade, dtype: category
Categories (3, object): [a, b, e]

Rename the categories to more meaningful names (assigning to Series.cat.categories is inplace!)

In [121]:
df["grade"].cat.categories = ["very good", "good", "very bad"]

Reorder the categories and simultaneously add the missing categories (methods under Series .cat return a new Series per default).

In [122]:
df["grade"] = df["grade"].cat.set_categories(["very bad", "bad", "medium", "good", "very good"])

In [123]:
df["grade"]

0    very good
1         good
2         good
3    very good
4    very good
5     very bad
Name: grade, dtype: category
Categories (5, object): [very bad, bad, medium, good, very good]

Sorting is per order in the categories, not lexical order.

In [124]:
df.sort_values(by="grade")

   id raw_grade      grade
5   6         e   very bad
1   2         b       good
2   3         b       good
0   1         a  very good
3   4         a  very good
4   5         a  very good

Grouping by a categorical column shows also empty categories.

In [125]:
df.groupby("grade").size()

grade
very bad     1
bad          0
medium       0
good         2
very good    3
dtype: int64

## Getting Data In/Out

### CSV
[Writing to a csv file](http://pandas.pydata.org/pandas-docs/stable/io.html#io-store-in-csv)

In [126]:
df.to_csv('foo.csv')

[Reading from a csv file](http://pandas.pydata.org/pandas-docs/stable/io.html#io-read-csv-table)

In [127]:
pd.read_csv('foo.csv')

   Unnamed: 0  id raw_grade      grade
0           0   1         a  very good
1           1   2         b       good
2           2   3         b       good
3           3   4         a  very good
4           4   5         a  very good
5           5   6         e   very bad

### Excel

Reading and writing to [MS Excel](http://pandas.pydata.org/pandas-docs/stable/io.html#io-excel)

Writing to an excel file

In [128]:
df.to_excel('foo.xlsx', sheet_name='Sheet1')

Reading from an excel file

In [129]:
pd.read_excel('foo.xlsx', 'Sheet1', index_col=None, na_values=['NA'])

   Unnamed: 0  id raw_grade      grade
0           0   1         a  very good
1           1   2         b       good
2           2   3         b       good
3           3   4         a  very good
4           4   5         a  very good
5           5   6         e   very bad